//1
let user = {
  name: "John",
  go: function() { alert(this.name) }
};

(user.go)() // John

//2
//У випадках (1) і (2) this всередині методу go вказує на об'єкт obj.
//У випадках (3) і (4) this буде undefined або глобальним об'єктом, оскільки функція більше не викликається безпосередньо через об'єкт, а зберігається в змінній і викликається без явного контексту.

(method = obj.go).bind(obj)();  // (3) викликає go() з правильним контекстом
(obj.go || obj.stop).bind(obj)(); // (4) викликає go() з правильним контекстом
